In [67]:
import pandas as pd
import numpy as np

data =pd.Series([1, 2, 3, 4], index = ['a', 'b', 'c', 'd'])
data

a    1
b    2
c    3
d    4
dtype: int64

In [4]:
data['b']

2

In [6]:
data.b

2

In [8]:
data =pd.Series([1, 2, 3, 4], index = ['a', 'b', 'c', 'd'], name = 'title')
data

a    1
b    2
c    3
d    4
Name: title, dtype: int64

In [38]:
popu = {
    'korea' : 5180,
    'japan' : 12718,
    'china' : 141500,
    'usa' : 32676
}

popu

{'korea': 5180, 'japan': 12718, 'china': 141500, 'usa': 32676}

In [39]:
population = pd.Series(popu)
population

korea      5180
japan     12718
china    141500
usa       32676
dtype: int64

In [40]:
gdp = pd.Series(popu)
country = pd.DataFrame({
    'population' : population,
    'gdp' : gdp
})

In [41]:
country

       population     gdp
korea        5180    5180
japan       12718   12718
china      141500  141500
usa         32676   32676

In [42]:
country.gdp

korea      5180
japan     12718
china    141500
usa       32676
Name: gdp, dtype: int64

In [43]:
country.index

Index(['korea', 'japan', 'china', 'usa'], dtype='object')

In [44]:
country['gdp']

korea      5180
japan     12718
china    141500
usa       32676
Name: gdp, dtype: int64

In [45]:
type(country['gdp'])

pandas.core.series.Series

In [46]:
gdp_per_capita =country['gdp'] / country['population']

In [47]:
country['gdp per capita'] = gdp_per_capita

In [48]:
country

       population     gdp  gdp per capita
korea        5180    5180             1.0
japan       12718   12718             1.0
china      141500  141500             1.0
usa         32676   32676             1.0

In [30]:
# country.to_csv("./country.csv")

In [31]:
# country = pd.read_csv("./country.csv")

In [32]:
# country.to_excel("./country.xlsx")

In [33]:
# country = pd.read_excel("./country.xlsx")

In [50]:
country

       population     gdp  gdp per capita
korea        5180    5180             1.0
japan       12718   12718             1.0
china      141500  141500             1.0
usa         32676   32676             1.0

In [49]:
country.loc['china'] # 행전체를 가져온다고 생각

population        141500.0
gdp               141500.0
gdp per capita         1.0
Name: china, dtype: float64

In [52]:
country.iloc[1] # 행접근

population        12718.0
gdp               12718.0
gdp per capita        1.0
Name: japan, dtype: float64

In [53]:
country.iloc[1:3, :2] # [행, 열]

       population     gdp
japan       12718   12718
china      141500  141500

In [54]:
country.iloc[1:3, :3] # [행, 열]

       population     gdp  gdp per capita
japan       12718   12718             1.0
china      141500  141500             1.0

In [63]:
df = pd.DataFrame(columns = ['이름', '나이', '주소'])
df.loc[0] = ['양진욱', '24', '서울']
df.loc[1] = ['박도현' ,'18', '서울']
df.loc[2] = {'이름' : '백승윤', '나이':'20', '주소' : 'LA'}
df.loc[3] = {'이름' : '아이유', '나이':'24', '주소' : '서울'}
df

    이름  나이  주소
0  양진욱  24  서울
1  박도현  18  서울
2  백승윤  20  LA
3  아이유  24  서울

In [64]:
df.loc[1,"이름"]

'박도현'

In [69]:
df['연락처'] = np.nan
df

    이름  나이  주소  연락처
0  양진욱  24  서울  NaN
1  박도현  18  서울  NaN
2  백승윤  20  LA  NaN
3  아이유  24  서울  NaN

In [71]:
df.loc[0, '전화번호'] = '01052915887'
df

    이름  나이  주소  연락처         전화번호
0  양진욱  24  서울  NaN  01052915887
1  박도현  18  서울  NaN          NaN
2  백승윤  20  LA  NaN          NaN
3  아이유  24  서울  NaN          NaN

In [72]:
len(df)

4

In [73]:
df['이름']

0    양진욱
1    박도현
2    백승윤
3    아이유
Name: 이름, dtype: object

In [74]:
df[['이름', '주소', '나이']] # 여러개 뽑을때 [[ ]]

    이름  주소  나이
0  양진욱  서울  24
1  박도현  서울  18
2  백승윤  LA  20
3  아이유  서울  24

In [75]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 4 entries, 0 to 3
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   이름      4 non-null      object
 1   나이      4 non-null      object
 2   주소      4 non-null      object
 3   연락처     0 non-null      float64
 4   전화번호    1 non-null      object
dtypes: float64(1), object(4)
memory usage: 352.0+ bytes

In [77]:
df.isnull()

      이름     나이     주소   연락처   전화번호
0  False  False  False  True  False
1  False  False  False  True   True
2  False  False  False  True   True
3  False  False  False  True   True

In [78]:
df.notnull()

     이름    나이    주소    연락처   전화번호
0  True  True  True  False   True
1  True  True  True  False  False
2  True  True  True  False  False
3  True  True  True  False  False

In [79]:
df.dropna()

Empty DataFrame
Columns: [이름, 나이, 주소, 연락처, 전화번호]
Index: []

In [80]:
df

    이름  나이  주소  연락처         전화번호
0  양진욱  24  서울  NaN  01052915887
1  박도현  18  서울  NaN          NaN
2  백승윤  20  LA  NaN          NaN
3  아이유  24  서울  NaN          NaN

In [81]:
df['전화번호'] = df['전화번호'].fillna('전화번호 없음') # fillna 공백에 값 입력

In [82]:
df

    이름  나이  주소  연락처         전화번호
0  양진욱  24  서울  NaN  01052915887
1  박도현  18  서울  NaN      전화번호 없음
2  백승윤  20  LA  NaN      전화번호 없음
3  아이유  24  서울  NaN      전화번호 없음

In [83]:
A = pd.Series([2, 4, 6], index = [0, 1, 2])
B = pd.Series([1, 3, 5], index = [1, 2, 3])
A+B # 매치 안되는것은 NaN

0    NaN
1    5.0
2    9.0
3    NaN
dtype: float64

In [86]:
A.add(B, fill_value = 0 )

0    2.0
1    5.0
2    9.0
3    5.0
dtype: float64

In [89]:
A = pd.DataFrame(np.random.randint(0, 10, (2,2)), columns = list("AB"))

In [90]:
A

   A  B
0  9  2
1  8  4

In [91]:
B = pd.DataFrame(np.random.randint(0, 10, (3,3)), columns = list("BAC"))

In [92]:
B

   B  A  C
0  7  6  6
1  8  8  7
2  1  2  4

In [93]:
A+B

      A     B   C
0  15.0   9.0 NaN
1  16.0  12.0 NaN
2   NaN   NaN NaN

In [95]:
A.add(B, fill_value = 0)

      A     B    C
0  15.0   9.0  6.0
1  16.0  12.0  7.0
2   2.0   1.0  4.0

In [96]:
data = {
    'a' : [i+5 for i in range(3)],
    'b' : [i**2 for i in range(3)]
}

In [97]:
data

{'a': [5, 6, 7], 'b': [0, 1, 4]}

In [100]:
df = pd.DataFrame(data)
df

   a  b
0  5  0
1  6  1
2  7  4

In [102]:
df['a'].sum()

18

In [103]:
df.sum()

a    18
b     5
dtype: int64

In [104]:
df.mean()

a    6.000000
b    1.666667
dtype: float64

In [108]:
df = pd.DataFrame({
    'col1' : [2, 1, 9, 8, 7, 4],
    'col2' : ['a', 'a', 'b', np.nan, 'd', 'c'],
    'col3' : [0, 1, 9, 4, 3, 2]
})
df

   col1 col2  col3
0     2    a     0
1     1    a     1
2     9    b     9
3     8  NaN     4
4     7    d     3
5     4    c     2

In [112]:
df.sort_values('col3', ascending = False) # 내림차순

   col1 col2  col3
2     9    b     9
3     8  NaN     4
4     7    d     3
5     4    c     2
1     1    a     1
0     2    a     0

In [113]:
df.sort_values(['col2', 'col1'])

   col1 col2  col3
1     1    a     1
0     2    a     0
2     9    b     9
5     4    c     2
4     7    d     3
3     8  NaN     4